In [47]:
import random as rd
import pandas as pd
import random as rd

mydict = {'X': [rd.randint(60, 100) for i in range(5)],
          'Y': [rd.randint(60, 100) for i in range(5)],
          'Z': [rd.randint(60, 100) for i in range(5)]}
df = pd.DataFrame(mydict)
df

    X   Y   Z
0  90  77  79
1  65  88  67
2  61  94  65
3  88  62  65
4  87  73  72

In [75]:
yn = ['yes', 'no']
df2 = pd.DataFrame({
    'name': ['A', 'B', 'C', 'D', 'E', 'F', 'G'],
    'score': [float(rd.randint(0, 40)) / 2 for i in range(7)],
    'attempts': [rd.randint(1, 3) for i in range(7)],
    'qualify': [rd.choice(yn) for i in range(7)]  
})

df2

  name  score  attempts qualify
0    A    8.0         3      no
1    B   14.5         1      no
2    C    0.5         2     yes
3    D    5.5         3      no
4    E    3.5         3      no
5    F    1.0         3     yes
6    G    0.5         2     yes

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
name        4 non-null object
score       2 non-null float64
attempts    4 non-null int64
qualify     4 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 208.0+ bytes

In [62]:
df2.describe()

           score  attempts
count   4.000000   4.00000
mean   12.250000   2.50000
std     8.311638   0.57735
min     0.500000   2.00000
25%    10.250000   2.00000
50%    14.250000   2.50000
75%    16.250000   3.00000
max    20.000000   3.00000

In [97]:
#NaN
df2.iloc[1,1] = df2.iloc[2,1] = np.nan
df2

   index name  score  attempts qualify
0      0    A    8.0         3      no
1      1  NaN   14.5         1      no
2      2  NaN    0.5         2     yes
3      3    D    5.5         3      no
4      4    E    3.5         3      no
5      5    F    1.0         3     yes
6      6    G    0.5         2     yes

In [64]:
#iv
count = 0
for k,v in df2.items():
    count += v.isna().sum()
    
df2.isnull().values.sum()
count

2

In [65]:
df2.isnull().sum()

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [66]:
df2.fillna(0, inplace=True)
df2

  name  score  attempts qualify
0    A   20.0         3      no
1    B    0.0         3      no
2    C    0.0         2      no
3    D   15.0         2     yes

In [80]:
df2.reset_index(level=0, inplace=True)
df2

   index name  score  attempts qualify
0      0    A    8.0         3      no
1      1    B   14.5         1      no
2      2    C    0.5         2     yes
3      3    D    5.5         3      no
4      4    E    3.5         3      no
5      5    F    1.0         3     yes
6      6    G    0.5         2     yes

In [76]:
df2.to_string(index=False)
df2

  name  score  attempts qualify
0    A    8.0         3      no
1    B   14.5         1      no
2    C    0.5         2     yes
3    D    5.5         3      no
4    E    3.5         3      no
5    F    1.0         3     yes
6    G    0.5         2     yes

In [ ]:
#Đếm số lượng hàng, số lượng cột.
print(f"So luong hang: {len(df2.axes[0])}, So luong cot: {len(df2.axes[1])}")

So luong hang: 7, So luong cot: 4

In [81]:
'''- Lấy danh sách tên các cột của df2 DataFrame đưa vào 1 array. Thực hiện lại tương tự
nhưng đưa danh sách vào 1 list.'''
arr = df2.columns.values
print(arr)
list1 = list(df2.columns.values)
print(list1)

['index' 'name' 'score' 'attempts' 'qualify']
['index', 'name', 'score', 'attempts', 'qualify']

In [ ]:
'''Dựa trên iterrows của đối tượng DataFrame, duyệt qua từng hàng và in dữ liệu ra
màn hình giá trị trên 3 cột: index, name, score'''
for index, row in df2.iterrows():
    print(row["index"], row["name"], row["score"])

0 A 8.0
1 B 14.5
2 C 0.5
3 D 5.5
4 E 3.5
5 F 1.0
6 G 0.5

In [93]:
'''Hiển thị dữ liệu của hàng thứ 5.
'''
print(df2.iloc[5])

index         5
name          F
score         1
attempts      3
qualify     yes
Name: 5, dtype: object

In [94]:
'''Hiển thị 3 hàng đầu tiên của dữ liệu.
'''
df2.iloc[:3]

   index name  score  attempts qualify
0      0    A    8.0         3      no
1      1    B   14.5         1      no
2      2    C    0.5         2     yes

In [95]:
'''Chỉ cho hiển thị cột name và score .'''
df2[['name', 'score']]

  name  score
0    A    8.0
1    B   14.5
2    C    0.5
3    D    5.5
4    E    3.5
5    F    1.0
6    G    0.5

In [118]:
'''Kết hợp câu d và câu e để có kết quả gồm 3 hàng và 2 cột.
'''
df2[:3][['name', 'score']]

  name  score
0    A    8.0
1  NaN   14.5
2  NaN    0.5

In [123]:
'''Chọn ra những hàng mà dữ liệu bị thiếu (NaN) trên cột score.'''
#print([df2.iloc[i] for i in range(len(df2)) if df2.iloc[i].isnull().any()])
df2[df2['name'].isnull()]

   index name  score  attempts qualify
1      1  NaN   14.5         1      no
2      2  NaN    0.5         2     yes

In [124]:
'''Chỉ cho hiển thị các hàng có attemps>2.
'''
df2[df2['attempts'] > 2]

   index name  score  attempts qualify
0      0    A    8.0         3      no
3      3    D    5.5         3      no
4      4    E    3.5         3      no
5      5    F    1.0         3     yes

In [126]:
'''Chọn ra những hàng mà giá trị trên cột score nằm trong khoảng tứ 15 đến 20'''
df2[(df2['score'] >= 15) & (df2['score'] <= 20)]

Empty DataFrame
Columns: [index, name, score, attempts, qualify]
Index: []

In [127]:
df2[df2['score'].between(15, 20)]

Empty DataFrame
Columns: [index, name, score, attempts, qualify]
Index: []

In [129]:
'''Chọn ra những hàng mà giá trị trên cột score <12 hoặc >=15.'''
df2[(df2['score'] < 12) | (df2['score'] >= 15)]

   index name  score  attempts qualify
0      0    A    8.0         3      no
2      2  NaN    0.5         2     yes
3      3    D    5.5         3      no
4      4    E    3.5         3      no
5      5    F    1.0         3     yes
6      6    G    0.5         2     yes

In [131]:
'''Chọn các hàng có số attempts nhỏ hơn 2 và có score lớn hơn 15.'''
df2[(df2['attempts'] < 2) & (df2['score'] > 15)]

Empty DataFrame
Columns: [index, name, score, attempts, qualify]
Index: []

In [133]:
'''Chọn ra những hàng có score>=18 (với đầy đủ các cột). Sau đó chỉ cho hiện nội dung
của 2 cột name và score.
'''
df2[df2['score'] >= 18][['name', 'score']]

Empty DataFrame
Columns: [name, score]
Index: []

In [ ]:
'''Sử dụng thuộc tính loc để sửa giá trị của hàng có chỉ mục 4 là trên cột score thành
11.5'''

SyntaxError: invalid syntax (<ipython-input-140-a32736e39b65>, line 1)